---
kind: property
id: P:Autodesk.Revit.DB.ExternalResourceReference.ServerId
source: html/1f2b2899-334f-b018-7e5a-6c3e17e910ec.htm
---
# Autodesk.Revit.DB.ExternalResourceReference.ServerId Property

The id of the server that Revit is expecting to provide the external resource.

## Syntax (C#)
```csharp
public Guid ServerId { get; }
```